Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ВидыМероприятийСУО/ВидыМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыМероприятийСУО</name>
  <predefined>
    <items>
      <name>НаОсновеЭлектронногоРесурса</name>
      <description>Электронное обучение</description>
    </items>
  </predefined>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершаетУчащийся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПрогрессЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйБаллЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФайловДляЗавершенияУчастником</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУчащимсяПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗапланированного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветАктивного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗавершенного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветОтмененного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестированияПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтветыВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОценкуВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьДоступКМатериаламПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданияПроверяютсяВыборочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодробныеСведенияОЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИзученияЭлектронныхКурсов</name>
    <type>
      <types>EnumRef.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТекущуюОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодчиненное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбязательныеСвойстваУчастников</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonModules/УправлениеОбучениемСУОКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРЕПОДАВАТЕЛИ

Функция ВыбратьПреподавателя(РольПреподавателя, Форма) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПреподавателяПродолжение", ЭтотОбъект, Новый Структура("Форма, РольПреподавателя", Форма, РольПреподавателя));		
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);	
	
КонецФункции

Процедура ВыбратьПреподавателяПродолжение(ВыбранныйПользователь, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйПользователь) <> Тип("СправочникСсылка.Пользователи")
		ИЛИ НЕ ЗначениеЗаполнено(ВыбранныйПользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.ЗачислитьПреподавателяНаКлиенте(ВыбранныйПользователь, ДополнительныеПараметры.РольПреподавателя);
	
КонецПроцедуры	

Процедура ВыбратьРольПреподавателя(РолиПреподавателей, Форма, Продолжение="ИзменитьРоль") Экспорт
	
	Если РолиПреподавателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если РолиПреподавателей.Количество() = 1 Тогда
		
		ВыбранноеЗначение = РолиПреподавателей.Получить(0);
		
		Если Продолжение = "ИзменитьРоль" Тогда
			ВыбратьРольПреподавателяПродолжениеИзменитьРоль(ВыбранноеЗначение, Форма);
		КонецЕсли;
		
		Если Продолжение = "ВыбратьПреподавателя" Тогда
			ВыбратьРольПреподавателяПродолжениеВыбратьПреподавателя(ВыбранноеЗначение, Форма);
		КонецЕсли;
		
	КонецЕсли;
	
	Если РолиПреподавателей.Количество() > 1 Тогда
		
		Если Продолжение = "ИзменитьРоль" Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьРольПреподавателяПродолжениеИзменитьРоль", ЭтотОбъект, Форма);	
		КонецЕсли;
		
		Если Продолжение = "ВыбратьПреподавателя" Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьРольПреподавателяПродолжениеВыбратьПреподавателя", ЭтотОбъект, Форма);	
		КонецЕсли;
		
		РолиПреподавателей.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите роль преподавателя'"));
				
	КонецЕсли;

КонецПроцедуры

Процедура ВыбратьРольПреподавателяПродолжениеИзменитьРоль(ВыбранноеЗначение, Форма) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИзменитьРольПреподавателяНаКлиенте(ВыбранноеЗначение.Значение);	
	
КонецПроцедуры	

Процедура ВыбратьРольПреподавателяПродолжениеВыбратьПреподавателя(ВыбранноеЗначение, Форма) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПреподавателя(ВыбранноеЗначение.Значение, Форма);
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ ОБУЧЕНИЯ

Процедура СоздатьОбучениеПоВиду(ВидОбучения, ЕстьМероприятие, ПоказатьКнопкуОтменыВыбора = Истина, Мероприятие = Неопределено, ЗначенияЗаполнения = Неопределено, ВладелецФормы = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидОбучения) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметрыСоздания = Новый Структура("ВидОбучения, ЗначенияЗаполнения, ВладелецФормы", ВидОбучения, ЗначенияЗаполнения, ВладелецФормы);
	
	Если ВидОбучения = ПредопределенноеЗначение("Справочник.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса") Тогда
		
		СоздатьОбучениеНаОсновеЭлектронногоРесурса(ДополнительныеПараметрыСоздания);
		
	Иначе
		
		Если ЕстьМероприятие И ПолучитьФункциональнуюОпциюИнтерфейса("ИспользоватьКаталогОбученийСУО") Тогда
			
			Если ЗначениеЗаполнено(Мероприятие) Тогда				
				ПровестиОбучениеНаОсновеМероприятияПродолжение(Мероприятие, ДополнительныеПараметрыСоздания);				
			Иначе				
				ПараметрыФормы = Новый Структура("Отбор, ПоказатьКнопкуОтменыВыбора", Новый Структура("Вид", ВидОбучения), ПоказатьКнопкуОтменыВыбора);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиОбучениеНаОсновеМероприятияПродолжение", ЭтотОбъект, ДополнительныеПараметрыСоздания);
				ОткрытьФорму("Справочник.КаталогМероприятийСУО.ФормаВыбора",ПараметрыФормы,,,,,ОписаниеОповещения);
			КонецЕсли;			
		
		Иначе
		
			ПровестиОбучениеБезСценарияПродолжение(ВидОбучения, ДополнительныеПараметрыСоздания);
		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПровестиОбучениеБезСценарияПродолжение(ВидОбучения, ДополнительныеПараметрыСоздания) Экспорт
	
	Если ВидОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("БезСценария, НаименованиеОбучения, ВидОбучения", Истина, Строка(ВидОбучения), ВидОбучения));
	
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(ДополнительныеПараметрыСоздания.ЗначенияЗаполнения) = Тип("Структура") Тогда
		Для каждого ЭлементСтруктуры Из ДополнительныеПараметрыСоздания.ЗначенияЗаполнения Цикл
			ПараметрыФормы.ЗначенияЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
	КонецЕсли;	
	
	ВладелецФормы = Неопределено;
		
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ВладелецФормы") Тогда		
		ВладелецФормы = ДополнительныеПараметрыСоздания.ВладелецФормы;		
	КонецЕсли;			
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);

КонецПроцедуры

Процедура ПровестиОбучениеНаОсновеМероприятияПродолжение(ВыбранноеМероприятие, ДополнительныеПараметрыСоздания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеМероприятие) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеМероприятие) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(ВыбранноеМероприятие) Тогда
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
			Новый Структура("НаОсновеМероприятия, Мероприятие", Истина, ВыбранноеМероприятие));
		
		Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
			И ДополнительныеПараметрыСоздания.Свойство("ЗначенияЗаполнения")
			И ТипЗнч(ДополнительныеПараметрыСоздания.ЗначенияЗаполнения) = Тип("Структура") Тогда
			
			Для каждого ЭлементСтруктуры Из ДополнительныеПараметрыСоздания.ЗначенияЗаполнения Цикл
				ПараметрыФормы.ЗначенияЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			КонецЦикла;
			
		КонецЕсли;			
		
		ВладелецФормы = Неопределено;
		
		Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
			И ДополнительныеПараметрыСоздания.Свойство("ВладелецФормы") Тогда		
			ВладелецФормы = ДополнительныеПараметрыСоздания.ВладелецФормы;		
		КонецЕсли;		
		
		ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
		
	Иначе		
		
		Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
			И ДополнительныеПараметрыСоздания.Свойство("ВидОбучения") Тогда			
			ПровестиОбучениеБезСценарияПродолжение(ДополнительныеПараметрыСоздания.ВидОбучения, ДополнительныеПараметрыСоздания);			
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьОбучениеНаОсновеЭлектронногоРесурса(ДополнительныеПараметрыСоздания)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиОбучениеНаОсновеЭлектронногоРесурсаПродолжение", ЭтотОбъект, ДополнительныеПараметрыСоздания);
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора",,,,,,ОписаниеОповещения);

КонецПроцедуры

Процедура ПровестиОбучениеНаОсновеЭлектронногоРесурсаПродолжение(ВыбранныйЭлектронныйРесурс, ДополнительныеПараметрыСоздания) Экспорт
	
	Если ВыбранныйЭлектронныйРесурс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
		Новый Структура("НаОсновеЭлектронногоРесурса, ЭлектронныйРесурс", Истина, ВыбранныйЭлектронныйРесурс));
	
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(ДополнительныеПараметрыСоздания.ЗначенияЗаполнения) = Тип("Структура") Тогда
		Для каждого ЭлементСтруктуры Из ДополнительныеПараметрыСоздания.ЗначенияЗаполнения Цикл
			ПараметрыФормы.ЗначенияЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
	КонецЕсли;		
	
	ВладелецФормы = Неопределено;
	
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ВладелецФормы") Тогда		
		ВладелецФормы = ДополнительныеПараметрыСоздания.ВладелецФормы;		
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);

КонецПроцедуры

Процедура РезультатыЗаданийУчастника(ПрохождениеОбучения, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	ЕстьПоддержкаСотрудников = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСотрудников();
	ЕстьПоддержкаСтудентов = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСтудентов();
	
	Если ЕстьПоддержкаСотрудников И НЕ ЕстьПоддержкаСтудентов Тогда
		ИмяФормыОтчета = "Отчет.РезультатыОбученияСУО.Форма";
	ИначеЕсли ЕстьПоддержкаСтудентов И НЕ ЕстьПоддержкаСотрудников Тогда
		ИмяФормыОтчета = "Отчет.РезультатыОбученияОО.Форма";
	Иначе
		ИмяФормыОтчета = "Отчет.РезультатыОбученияСУ.Форма";
	КонецЕсли;		
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Новый Структура("ПрохождениеОбучения", ПрохождениеОбучения), Истина, "ЗаданияУчастников");
	
	Если ПараметрыВыполненияКоманды = Неопределено Тогда
		ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы);
	Иначе
		ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;	

КонецПроцедуры

Процедура ВыполнитьПроверкуКорректностиДатПроведенияОбучения(
	ТекстВопроса, 
	Отказ,
	Знач Статус,
	Знач ДатаОкончанияПроведения,
	Знач ДатаКонтроля,
	Знач ДатаНачалаДоступа,
	Знач ДатаНачалаПроведения) Экспорт
	
	// Активное
	
	ТекущаяДатаКлиента = ТекущаяДата();
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
		И (ЗначениеЗаполнено(ДатаОкончанияПроведения) И ДатаОкончанияПроведения < ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля < ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Активно, но дата окончания обучения уже прошла. Продолжить?'");
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
		И (ЗначениеЗаполнено(ДатаНачалаПроведения) И ДатаНачалаПроведения > ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаНачалаДоступа) И ДатаНачалаДоступа > ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Активно, но дата начала обучения еще не наступила. Продолжить?'");
	КонецЕсли;		
	
	// Завершенное
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Завершено")
		И (ЗначениеЗаполнено(ДатаОкончанияПроведения) И ДатаОкончанияПроведения >= ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля >= ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Завершено, но дата окончания еще не прошла. Продолжить?'");
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Завершено")
		И (ЗначениеЗаполнено(ДатаНачалаПроведения) И ДатаНачалаПроведения > ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаНачалаДоступа) И ДатаНачалаДоступа > ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Завершено, но дата начала обучения еще не наступила. Продолжить?'");
	КонецЕсли;	
	
	// Запланированное
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано")
		И (ЗначениеЗаполнено(ДатаНачалаДоступа) И ДатаНачалаДоступа <= ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаНачалаПроведения) И ДатаНачалаПроведения <= ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Запланировано, но дата начала обучения уже наступила. Продолжить?'");
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано")
		И (ЗначениеЗаполнено(ДатаОкончанияПроведения) И ДатаОкончанияПроведения < ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля < ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Запланировано, но дата окончания обучения уже прошла. Продолжить?'");
	КонецЕсли;	

	
КонецПроцедуры	
	

////////////////////////////////////////////////////////////////////////////////
// ХАРАКТЕРИСТИКИ УЧЕБНЫХ ОБЪЕКТОВ

// Добавляет характеристику интерактивно
//
Процедура ДобавитьХарактеристику(Форма) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьХарактеристикуПродолжение", ЭтотОбъект, Форма);		
	
	ОткрытьФорму("ПланВидовХарактеристик.ХарактеристикиУчебныхОбъектовСУО.ФормаВыбора",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

Процедура ДобавитьХарактеристикуПродолжение(ВидХарактеристики, Форма) Экспорт
	
	Если ЗначениеЗаполнено(ВидХарактеристики) Тогда

		Если Форма.ОписаниеХарактеристик.НайтиСтроки(Новый Структура("ВидХарактеристики", ВидХарактеристики)).Количество() > 0 Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Характеристика уже существует'", "ru"));
		Иначе
			Форма.ДобавитьХарактеристикуНаСервере(ВидХарактеристики);	 
		КонецЕсли;	 
		
	КонецЕсли;
	
КонецПроцедуры	

// Удаляет характеристику интерактивно
//
Процедура УдалитьХарактеристику(Форма) Экспорт
	
	// Выберем удаляемый вид
	СписокВидов = Новый СписокЗначений;
	Для каждого ОписаниеХарактеристики Из Форма.ОписаниеХарактеристик Цикл
		ЭлементСпискаВидов = СписокВидов.Добавить();
		ЭлементСпискаВидов.Значение = ОписаниеХарактеристики.ПолучитьИдентификатор();
		ЭлементСпискаВидов.Представление = Строка(ОписаниеХарактеристики.ВидХарактеристики);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьХарактеристикуПродолжение", ЭтотОбъект, Форма);
	
	СписокВидов.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Удалить характеристику:'"));
	
КонецПроцедуры

Процедура УдалитьХарактеристикуПродолжение(ВыбранныйЭлемент, Форма) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Форма.УдалитьХарактеристикуНаСервере(ВыбранныйЭлемент.Значение)
	КонецЕсли;
	
КонецПроцедуры
